package lesson17;

public class Lesson17LectureJavaUtils {
    /*
======================================================== Atomics =======================================================
    //TODO:
    Atomics - типы атомарных переменных:
        AtomicBoolean -
        AtomicReference -
        AtomicInteger -
        AtomicLong -

    Атомарное действие -

======================================================== Volatile ======================================================

    Volatile - это //TODO: записать значение

    Volatile переменные предотвращают проблему рассинхронизации.

========================================================= Lock =========================================================

    Разделитель потоков, что бы одновременно работал только один поток.

    Lock можно использовать для того, чтобы, если один пользователь пишет в файл, то другой пользователь не смог этого
    сделать до тех пор, пока не закончит первый.

 ** Разница между Synchronized и Lock в том, что первый блокирует метод полностью на время выполнения кода. Lock может
    делать сквозную блокировку, которой можно заблокировать метод в одной части и высвободить тогда, когда нам надо.
    Т.е. Lock более гибкая блокировка, чем Synchronized.

===================================================== Executor API =====================================================

    Executor API - //TODO: записать значение

======================================================= Callable =======================================================

    // TODO : ?





     */
}
